In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family'] ='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [20]:
data={ 'eng':[10,30,50,70],
       'kor':[20,40,60,80],
       'math':[90,50,20,70] }
df = pd.DataFrame(data, index=['a','b','c','d'] )
df.index.name = '이름'
df

    eng  kor  math
이름
a    10   20    90
b    30   40    50
c    50   60    20
d    70   80    70

In [3]:
for n in df:  # df.columns
    print(n)

eng
kor
math

In [4]:
for n in df.index: 
    print(n)

a
b
c
d

In [5]:
for n in df.items(): 
    print(n)
    print("==============")

('eng', 이름
a    10
b    30
c    50
d    70
Name: eng, dtype: int64)
=======
('kor', 이름
a    20
b    40
c    60
d    80
Name: kor, dtype: int64)
=======
('math', 이름
a    90
b    50
c    20
d    70
Name: math, dtype: int64)
=======

In [8]:
for c,sr in df.items(): 
    print(c, sr[0],sr[1],sr[2],sr[3])

eng 10 30 50 70
kor 20 40 60 80
math 90 50 20 70

In [10]:
for i, sr in df.iterrows(): 
    print(i, sr[0],sr[1],sr[2])

a 10 20 90
b 30 40 50
c 50 60 20
d 70 80 70

In [11]:
df.dtypes

eng     int64
kor     int64
math    int64
dtype: object

In [16]:
df.astype(np.float32).info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eng     4 non-null      float32
 1   kor     4 non-null      float32
 2   math    4 non-null      float32
dtypes: float32(3)
memory usage: 80.0+ bytes

In [13]:
df = df.astype(np.float32)
df

     eng   kor  math
이름
a   10.0  20.0  90.0
b   30.0  40.0  50.0
c   50.0  60.0  20.0
d   70.0  80.0  70.0

In [19]:
df['eng'] = df['eng'].astype(np.float32)
df

     eng  kor  math
이름
a   10.0   20    90
b   30.0   40    50
c   50.0   60    20
d   70.0   80    70

In [22]:
df.set_index('eng',drop=False)

     kor  math
eng
10    20    90
30    40    50
50    60    20
70    80    70

In [ ]:
df.reset_index()  #인덱스->콜럼

In [ ]:
df.reset_index().set_index('eng') # 인덱스 손실없이

In [23]:
df.rename(index={'a':'홍길동','c':'이순신'})

     eng  kor  math
이름
홍길동   10   20    90
b     30   40    50
이순신   50   60    20
d     70   80    70

In [24]:
df.rename(columns={'kor':'국어'})

    eng  국어  math
이름
a    10  20    90
b    30  40    50
c    50  60    20
d    70  80    70